test/liquid_solid_fluidized_bed_mix/force_buoyancy+drag/Yang/CFD/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains 2;

method          simple;

simpleCoeffs
{
  n               ( 1 1 2 );
  delta           0.001;
}

hierarchicalCoeffs
{
  n               ( 2 2 1 );
  delta           0.001;
  order           xyz;
}

metisCoeffs
{
}

manualCoeffs
{
  dataFile        "";
}

distributed     no;

roots           ( );

